node {
  name: "code_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 32
        }
      }
    }
  }
}
node {
  name: "image_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 192
        }
        dim {
          size: 256
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "zeros"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "stack"
  op: "Pack"
  input: "zeros"
  attr {
    key: "N"
    value {
      i: 1
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "add"
  op: "Add"
  input: "code_input"
  input: "stack"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\000\000\000\000\003\000\000\000\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "transpose"
  op: "Transpose"
  input: "image_input"
  input: "transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_0/kernel/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_0/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\007\000\000\000\007\000\000\000\001\000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_0/kernel/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_0/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_0/kernel/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_0/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.23035022616386414
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_0/kernel/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "CNN/img_decompose/img_unet/enc/conv_0/kernel/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_0/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_0/kernel/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "CNN/img_decompose/img_unet/enc/conv_0/kernel/Initializer/truncated_normal/TruncatedNormal"
  input: "CNN/img_decompose/img_unet/enc/conv_0/kernel/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_0/kernel"
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_0/kernel/Initializer/truncated_normal"
  op: "Add"
  input: "CNN/img_decompose/img_unet/enc/conv_0/kernel/Initializer/truncated_normal/mul"
  input: "CNN/img_decompose/img_unet/enc/conv_0/kernel/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_0/kernel"
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_0/kernel"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_0/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 7
        }
        dim {
          size: 7
        }
        dim {
          size: 1
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_0/kernel/Assign"
  op: "Assign"
  input: "CNN/img_decompose/img_unet/enc/conv_0/kernel"
  input: "CNN/img_decompose/img_unet/enc/conv_0/kernel/Initializer/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_0/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_0/kernel/read"
  op: "Identity"
  input: "CNN/img_decompose/img_unet/enc/conv_0/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_0/kernel"
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_0/kernel/Regularizer/l2_regularizer/scale"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_0/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_0/kernel/Regularizer/l2_regularizer/L2Loss"
  op: "L2Loss"
  input: "CNN/img_decompose/img_unet/enc/conv_0/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_0/kernel"
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_0/kernel/Regularizer/l2_regularizer"
  op: "Mul"
  input: "CNN/img_decompose/img_unet/enc/conv_0/kernel/Regularizer/l2_regularizer/scale"
  input: "CNN/img_decompose/img_unet/enc/conv_0/kernel/Regularizer/l2_regularizer/L2Loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_0/kernel"
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_0/biases/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_0/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_0/biases"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_0/biases"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_0/biases/Assign"
  op: "Assign"
  input: "CNN/img_decompose/img_unet/enc/conv_0/biases"
  input: "CNN/img_decompose/img_unet/enc/conv_0/biases/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_0/biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_0/biases/read"
  op: "Identity"
  input: "CNN/img_decompose/img_unet/enc/conv_0/biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_0/biases"
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_0/biases/Regularizer/l2_regularizer/scale"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_0/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_0/biases/Regularizer/l2_regularizer/L2Loss"
  op: "L2Loss"
  input: "CNN/img_decompose/img_unet/enc/conv_0/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_0/biases"
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_0/biases/Regularizer/l2_regularizer"
  op: "Mul"
  input: "CNN/img_decompose/img_unet/enc/conv_0/biases/Regularizer/l2_regularizer/scale"
  input: "CNN/img_decompose/img_unet/enc/conv_0/biases/Regularizer/l2_regularizer/L2Loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_0/biases"
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_0/MirrorPad/paddings"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\003\000\000\000\003\000\000\000\003\000\000\000\003\000\000\000"
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_0/MirrorPad"
  op: "MirrorPad"
  input: "transpose"
  input: "CNN/img_decompose/img_unet/enc/conv_0/MirrorPad/paddings"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tpaddings"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "mode"
    value {
      s: "SYMMETRIC"
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_0/Conv2D"
  op: "Conv2D"
  input: "CNN/img_decompose/img_unet/enc/conv_0/MirrorPad"
  input: "CNN/img_decompose/img_unet/enc/conv_0/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NCHW"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 2
        i: 2
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_0/BiasAdd"
  op: "BiasAdd"
  input: "CNN/img_decompose/img_unet/enc/conv_0/Conv2D"
  input: "CNN/img_decompose/img_unet/enc/conv_0/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NCHW"
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_0/LeakyRelu"
  op: "LeakyRelu"
  input: "CNN/img_decompose/img_unet/enc/conv_0/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "alpha"
    value {
      f: 0.20000000298023224
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_1/kernel/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000@\000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_1/kernel/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_1/kernel/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.06718548387289047
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_1/kernel/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "CNN/img_decompose/img_unet/enc/conv_1/kernel/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_1/kernel/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "CNN/img_decompose/img_unet/enc/conv_1/kernel/Initializer/truncated_normal/TruncatedNormal"
  input: "CNN/img_decompose/img_unet/enc/conv_1/kernel/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_1/kernel"
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_1/kernel/Initializer/truncated_normal"
  op: "Add"
  input: "CNN/img_decompose/img_unet/enc/conv_1/kernel/Initializer/truncated_normal/mul"
  input: "CNN/img_decompose/img_unet/enc/conv_1/kernel/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_1/kernel"
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_1/kernel"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_1/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 64
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_1/kernel/Assign"
  op: "Assign"
  input: "CNN/img_decompose/img_unet/enc/conv_1/kernel"
  input: "CNN/img_decompose/img_unet/enc/conv_1/kernel/Initializer/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_1/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_1/kernel/read"
  op: "Identity"
  input: "CNN/img_decompose/img_unet/enc/conv_1/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_1/kernel"
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_1/kernel/Regularizer/l2_regularizer/scale"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_1/kernel/Regularizer/l2_regularizer/L2Loss"
  op: "L2Loss"
  input: "CNN/img_decompose/img_unet/enc/conv_1/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_1/kernel"
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_1/kernel/Regularizer/l2_regularizer"
  op: "Mul"
  input: "CNN/img_decompose/img_unet/enc/conv_1/kernel/Regularizer/l2_regularizer/scale"
  input: "CNN/img_decompose/img_unet/enc/conv_1/kernel/Regularizer/l2_regularizer/L2Loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_1/kernel"
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_1/biases/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_1/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_1/biases"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_1/biases"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_1/biases/Assign"
  op: "Assign"
  input: "CNN/img_decompose/img_unet/enc/conv_1/biases"
  input: "CNN/img_decompose/img_unet/enc/conv_1/biases/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_1/biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_1/biases/read"
  op: "Identity"
  input: "CNN/img_decompose/img_unet/enc/conv_1/biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_1/biases"
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_1/biases/Regularizer/l2_regularizer/scale"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_1/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_1/biases/Regularizer/l2_regularizer/L2Loss"
  op: "L2Loss"
  input: "CNN/img_decompose/img_unet/enc/conv_1/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_1/biases"
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_1/biases/Regularizer/l2_regularizer"
  op: "Mul"
  input: "CNN/img_decompose/img_unet/enc/conv_1/biases/Regularizer/l2_regularizer/scale"
  input: "CNN/img_decompose/img_unet/enc/conv_1/biases/Regularizer/l2_regularizer/L2Loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_1/biases"
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_1/MirrorPad/paddings"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\001\000\000\000\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_1/MirrorPad"
  op: "MirrorPad"
  input: "CNN/img_decompose/img_unet/enc/conv_0/LeakyRelu"
  input: "CNN/img_decompose/img_unet/enc/conv_1/MirrorPad/paddings"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tpaddings"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "mode"
    value {
      s: "SYMMETRIC"
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_1/Conv2D"
  op: "Conv2D"
  input: "CNN/img_decompose/img_unet/enc/conv_1/MirrorPad"
  input: "CNN/img_decompose/img_unet/enc/conv_1/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NCHW"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_1/BiasAdd"
  op: "BiasAdd"
  input: "CNN/img_decompose/img_unet/enc/conv_1/Conv2D"
  input: "CNN/img_decompose/img_unet/enc/conv_1/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NCHW"
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_1/LeakyRelu"
  op: "LeakyRelu"
  input: "CNN/img_decompose/img_unet/enc/conv_1/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "alpha"
    value {
      f: 0.20000000298023224
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_2/kernel/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_2/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000@\000\000\000\200\000\000\000"
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_2/kernel/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_2/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_2/kernel/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_2/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.06718548387289047
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_2/kernel/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "CNN/img_decompose/img_unet/enc/conv_2/kernel/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_2/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_2/kernel/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "CNN/img_decompose/img_unet/enc/conv_2/kernel/Initializer/truncated_normal/TruncatedNormal"
  input: "CNN/img_decompose/img_unet/enc/conv_2/kernel/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_2/kernel"
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_2/kernel/Initializer/truncated_normal"
  op: "Add"
  input: "CNN/img_decompose/img_unet/enc/conv_2/kernel/Initializer/truncated_normal/mul"
  input: "CNN/img_decompose/img_unet/enc/conv_2/kernel/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_2/kernel"
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_2/kernel"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_2/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 64
        }
        dim {
          size: 128
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_2/kernel/Assign"
  op: "Assign"
  input: "CNN/img_decompose/img_unet/enc/conv_2/kernel"
  input: "CNN/img_decompose/img_unet/enc/conv_2/kernel/Initializer/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_2/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_2/kernel/read"
  op: "Identity"
  input: "CNN/img_decompose/img_unet/enc/conv_2/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_2/kernel"
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_2/kernel/Regularizer/l2_regularizer/scale"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_2/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_2/kernel/Regularizer/l2_regularizer/L2Loss"
  op: "L2Loss"
  input: "CNN/img_decompose/img_unet/enc/conv_2/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_2/kernel"
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_2/kernel/Regularizer/l2_regularizer"
  op: "Mul"
  input: "CNN/img_decompose/img_unet/enc/conv_2/kernel/Regularizer/l2_regularizer/scale"
  input: "CNN/img_decompose/img_unet/enc/conv_2/kernel/Regularizer/l2_regularizer/L2Loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_2/kernel"
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_2/biases/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_2/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 128
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_2/biases"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_2/biases"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 128
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_2/biases/Assign"
  op: "Assign"
  input: "CNN/img_decompose/img_unet/enc/conv_2/biases"
  input: "CNN/img_decompose/img_unet/enc/conv_2/biases/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_2/biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_2/biases/read"
  op: "Identity"
  input: "CNN/img_decompose/img_unet/enc/conv_2/biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_2/biases"
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_2/biases/Regularizer/l2_regularizer/scale"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_2/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_2/biases/Regularizer/l2_regularizer/L2Loss"
  op: "L2Loss"
  input: "CNN/img_decompose/img_unet/enc/conv_2/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_2/biases"
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_2/biases/Regularizer/l2_regularizer"
  op: "Mul"
  input: "CNN/img_decompose/img_unet/enc/conv_2/biases/Regularizer/l2_regularizer/scale"
  input: "CNN/img_decompose/img_unet/enc/conv_2/biases/Regularizer/l2_regularizer/L2Loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_2/biases"
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_2/MirrorPad/paddings"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\001\000\000\000\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_2/MirrorPad"
  op: "MirrorPad"
  input: "CNN/img_decompose/img_unet/enc/conv_1/LeakyRelu"
  input: "CNN/img_decompose/img_unet/enc/conv_2/MirrorPad/paddings"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tpaddings"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "mode"
    value {
      s: "SYMMETRIC"
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_2/Conv2D"
  op: "Conv2D"
  input: "CNN/img_decompose/img_unet/enc/conv_2/MirrorPad"
  input: "CNN/img_decompose/img_unet/enc/conv_2/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NCHW"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 2
        i: 2
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_2/BiasAdd"
  op: "BiasAdd"
  input: "CNN/img_decompose/img_unet/enc/conv_2/Conv2D"
  input: "CNN/img_decompose/img_unet/enc/conv_2/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NCHW"
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_2/LeakyRelu"
  op: "LeakyRelu"
  input: "CNN/img_decompose/img_unet/enc/conv_2/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "alpha"
    value {
      f: 0.20000000298023224
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_3/kernel/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_3/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\200\000\000\000\200\000\000\000"
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_3/kernel/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_3/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_3/kernel/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_3/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.047507308423519135
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_3/kernel/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "CNN/img_decompose/img_unet/enc/conv_3/kernel/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_3/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_3/kernel/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "CNN/img_decompose/img_unet/enc/conv_3/kernel/Initializer/truncated_normal/TruncatedNormal"
  input: "CNN/img_decompose/img_unet/enc/conv_3/kernel/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_3/kernel"
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_3/kernel/Initializer/truncated_normal"
  op: "Add"
  input: "CNN/img_decompose/img_unet/enc/conv_3/kernel/Initializer/truncated_normal/mul"
  input: "CNN/img_decompose/img_unet/enc/conv_3/kernel/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_3/kernel"
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_3/kernel"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_3/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 128
        }
        dim {
          size: 128
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_3/kernel/Assign"
  op: "Assign"
  input: "CNN/img_decompose/img_unet/enc/conv_3/kernel"
  input: "CNN/img_decompose/img_unet/enc/conv_3/kernel/Initializer/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_3/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_3/kernel/read"
  op: "Identity"
  input: "CNN/img_decompose/img_unet/enc/conv_3/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_3/kernel"
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_3/kernel/Regularizer/l2_regularizer/scale"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_3/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_3/kernel/Regularizer/l2_regularizer/L2Loss"
  op: "L2Loss"
  input: "CNN/img_decompose/img_unet/enc/conv_3/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_3/kernel"
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_3/kernel/Regularizer/l2_regularizer"
  op: "Mul"
  input: "CNN/img_decompose/img_unet/enc/conv_3/kernel/Regularizer/l2_regularizer/scale"
  input: "CNN/img_decompose/img_unet/enc/conv_3/kernel/Regularizer/l2_regularizer/L2Loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_3/kernel"
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_3/biases/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_3/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 128
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_3/biases"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_3/biases"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 128
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_3/biases/Assign"
  op: "Assign"
  input: "CNN/img_decompose/img_unet/enc/conv_3/biases"
  input: "CNN/img_decompose/img_unet/enc/conv_3/biases/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_3/biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_3/biases/read"
  op: "Identity"
  input: "CNN/img_decompose/img_unet/enc/conv_3/biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_3/biases"
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_3/biases/Regularizer/l2_regularizer/scale"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_3/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_3/biases/Regularizer/l2_regularizer/L2Loss"
  op: "L2Loss"
  input: "CNN/img_decompose/img_unet/enc/conv_3/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_3/biases"
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_3/biases/Regularizer/l2_regularizer"
  op: "Mul"
  input: "CNN/img_decompose/img_unet/enc/conv_3/biases/Regularizer/l2_regularizer/scale"
  input: "CNN/img_decompose/img_unet/enc/conv_3/biases/Regularizer/l2_regularizer/L2Loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_3/biases"
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_3/MirrorPad/paddings"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\001\000\000\000\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_3/MirrorPad"
  op: "MirrorPad"
  input: "CNN/img_decompose/img_unet/enc/conv_2/LeakyRelu"
  input: "CNN/img_decompose/img_unet/enc/conv_3/MirrorPad/paddings"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tpaddings"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "mode"
    value {
      s: "SYMMETRIC"
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_3/Conv2D"
  op: "Conv2D"
  input: "CNN/img_decompose/img_unet/enc/conv_3/MirrorPad"
  input: "CNN/img_decompose/img_unet/enc/conv_3/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NCHW"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_3/BiasAdd"
  op: "BiasAdd"
  input: "CNN/img_decompose/img_unet/enc/conv_3/Conv2D"
  input: "CNN/img_decompose/img_unet/enc/conv_3/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NCHW"
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_3/LeakyRelu"
  op: "LeakyRelu"
  input: "CNN/img_decompose/img_unet/enc/conv_3/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "alpha"
    value {
      f: 0.20000000298023224
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_4/kernel/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_4/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\200\000\000\000\000\001\000\000"
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_4/kernel/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_4/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_4/kernel/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_4/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.047507308423519135
      }
    }
  }
}
node {
  name: "CNN/img_decompose/img_unet/enc/conv_4/kernel/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "CNN/img_decompose/img_unet/enc/conv_4/kernel/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@CNN/img_decompose/img_unet/enc/conv_4/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
